// 1. Створити пустий масив та :

//        a. заповнити його 50 парними числами за допомоги циклу.
// let numbers = [];
// for ( i = 2; numbers.length < 50; i += 2) {
//     numbers.push(i);
// }
// console.log(numbers);

//        b. заповнити його 50 непарними числами за допомоги циклу.
// let numbers = [];
// for ( i = 1; numbers.length < 50; i += 2 ) {
//     numbers.push(i);
// }
// console.log(numbers);

//        c. Заповнити масив 20-ма рандомними числами. (Google: Generate random number JS)
// let numbers = [];
// for (let i = 0; i <20; i++) {
//     numbers.push(Math.floor(Math.random() * 100));
//     }
// console.log(numbers);

//        d. Заповнити масив 20-ма рандомними числами в діапазоні від 8 до 732 (Google: Generate random number JS)
// let numbers = [];
// let newArr = [];
// for (let i = 0; i <20; i++) {
//     numbers.push(Math.floor(Math.random() * (732 - 8 + 1)) + 8);
// }
// console.log(numbers);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//2. Вивести за допомогою console.log кожен третій елемент

// for (let i = 0; i < numbers.length; i +=3) {
//     console.log(numbers[i]);
// }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//3. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним.

// for (let i = 0; i < numbers.length; i +=3) {
//     if (numbers[i] % 2 === 0) {
//         console.log(numbers[i]);
//     }
// }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//4.Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним, та записати їх в новий масив

// for (let i = 0; i < numbers.length; i +=3) {
//     if (numbers[i] % 2 === 0) {
//         console.log(numbers[i]);
//         newArr.push(numbers[i]);
//     }
// }
// console.log(newArr);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//5. Вивести кожен елемент масиву, сусід справа якого є парним

// for (let i = 0; i < numbers.length-1; i++) {
//     if (numbers[i+1] % 2 === 0) {
//         console.log(numbers[i]);
//     }
// }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//6.Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.

// let numbers = [100,250,50,168,120,345,188];
// let sum = 0;
//
// for (let number of numbers) {
//     sum = sum + number;
// }
// let average = sum / numbers.length;
// console.log(average);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.

// let numbers = [];
// let multiplication = [];
// for (let i = 0; i <20; i++) {
//     numbers.push(Math.floor(Math.random() * 100));
//     }
// console.log(numbers);
// for (number of numbers) {
//         multiplication.push(number*5);
// }
// console.log(multiplication);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//8.Створити масив з будь-якими значеннями (стрінги, числа, і тд…).
// пройтись по ньому, і, якщо елемент є числом, додати його в інший масив.

// let arr = [1, "hello", true, 3.14, "JS", false, 9];
// let newArr = [];
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
//     if (typeof arr[i] === 'number') {
//         newArr.push(arr[i]);
//     }
// }
// console.log(newArr)

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

