//Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

// let numbers = [];
//  for (let i = 0; i <10; i++) {
//      numbers.push(Math.floor(Math.random() * 100));
//      if (numbers[i] % 2 === 0) {
//          console.log(numbers[i]);
//      }
// }

 // Взяти масив з 10 чисел або створити його.
// Створити 2-й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.

let numbers = [28, 84, 114, 345, 205, 456, 789, 93, 16, 20];
let array = [];
for (let i = 0; i < 10; i++) {
    array.push(numbers[i]);
}
console.log(array);
